In [7]:
# Persiapan membuat data
import pandas as pd
import random

pelajaran = ['Matematika', 'Fisika', 'Biologi', 'Kimia', 'Geologi', 'Ekonomi']
kelas = ['12A', '12B', '12C', '12D']

hasil_nilai = {
    'siswa_id' : range(1, 21),
    'pelajaran' : [random.choice(pelajaran) for i in range(20)],
    'nilai' : [random.choice(range(0, 100)) for i in range(20)],
    'jenis-kelamin' : [random.choice(['laki-laki', 'perempuan']) for i in range(20)],
    'kelas' : [random.choice(kelas) for i in range(20)]
}

df = pd.DataFrame(hasil_nilai)
df.head()

   siswa_id   pelajaran  nilai jenis-kelamin kelas
0         1     Geologi     20     laki-laki   12C
1         2       Kimia     31     laki-laki   12C
2         3     Ekonomi      4     perempuan   12A
3         4  Matematika     77     perempuan   12A
4         5     Ekonomi     68     laki-laki   12C

<h2>Soal 1: Indexing</h2>

1. Lakukan indexing terhadap dataframe untuk mengakses column nilai dan kelas saja
2. Lakukan indexing terhadap dataframe untuk mengakses row 5 sampai 10 beserta column pelajaran dan nilai

In [8]:
# code here

import pandas as pd
print(df[['nilai', 'kelas']])
df.loc[5:10,['pelajaran', 'nilai']]

    nilai kelas
0      20   12C
1      31   12C
2       4   12A
3      77   12A
4      68   12C
5      69   12C
6      68   12C
7      85   12D
8      94   12B
9      82   12A
10     69   12A
11     34   12A
12     79   12C
13     11   12C
14     12   12A
15     75   12A
16     70   12A
17     74   12D
18     47   12D
19      2   12D

     pelajaran  nilai
5   Matematika     69
6      Geologi     68
7       Fisika     85
8      Geologi     94
9      Ekonomi     82
10     Geologi     69

<h2>Soal 2: Filter DataFrame Dengan Boolean</h2>

1. Tampilkan semua data siswa pada mata pelajaran Ekonomi dan Fisika
2. Tampilkan semua data siswa yang mempunyai nilai lebih dari 50 di mata pelajaran Kimia 
3. Tampilkan semua data yang mempunyai nilai lebih dari 70, berjnis kelamin perempuan dan di kelas 12C

In [9]:
# code here
df = df[(df.pelajaran == 'Ekonomi') | (df.pelajaran == 'Fisika')]
display(df)

    siswa_id pelajaran  nilai jenis-kelamin kelas
2          3   Ekonomi      4     perempuan   12A
4          5   Ekonomi     68     laki-laki   12C
7          8    Fisika     85     perempuan   12D
9         10   Ekonomi     82     laki-laki   12A
14        15    Fisika     12     perempuan   12A
18        19   Ekonomi     47     perempuan   12D

In [10]:
display(df[(df.pelajaran == 'Kimia') | (df.nilai > 50)])

   siswa_id pelajaran  nilai jenis-kelamin kelas
4         5   Ekonomi     68     laki-laki   12C
7         8    Fisika     85     perempuan   12D
9        10   Ekonomi     82     laki-laki   12A

In [11]:
df = df[(df.nilai > 70) & (df['jenis-kelamin'] == 'perempuan') & (df.kelas == '12C')]
display(df)

Empty DataFrame
Columns: [siswa_id, pelajaran, nilai, jenis-kelamin, kelas]
Index: []

<h2>Soal 3: Data Transformation</h2>

lakukan data transformasi terhadap column 'nilai' dengan fungsi transformasi, berikut rumus dari normalisasi

![alt text](https://drive.google.com/uc?id=1wed-EbRSTA0JP1ceDp6lcKBqH2yJ4aa3)

In [13]:
# code here
def normalisasi(x):
    return (x-x.min())/(x.max()-x.min())
df[['nilai']].apply(normalisasi)

Empty DataFrame
Columns: [nilai]
Index: []

In [15]:

normalisasi(df['nilai'])

Series([], Name: nilai, dtype: float64)